#include <iostream>

/*
Разглеждаме координатна система, ограничена само в първия квадрант. Площта е разделена на редици от квадратчета със страна `a` (естествено число). 
Квадратите се редуват по цвят – черен и бял, като квадратът в началото на координатната система (върху осите OX и OY) винаги е **черен**.
Напишете програма, която въвежда дължината `a` и координатите на точка `(x, y)` и извежда цвета на квадрата, в който попада точката.
*/

int main()
{
    unsigned x, y, side;
    std::cin >> side >> x >> y;
    
    if(( x / side) % 2 == ( y / side) % 2)
        std::cout << "black";
    else
        std::cout << "white";

}
